#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

data.aws_iam_role.labrole: Reading...
aws_vpc.tc_vpc: Refreshing state... [id=vpc-0752b1eab91432156]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-0abda6c2aa9f452e4]
aws_apigatewayv2_api.tc_api_gateway: Refreshing state... [id=nke2af8wyh]
aws_s3_bucket.video_upload_s3: Refreshing state... [id=videouploadtc]
data.aws_iam_role.labrole: Read complete after 0s [id=LabRole]
aws_apigatewayv2_stage.dev: Refreshing state... [id=$default]
aws_subnet.public_subnet_2: Refreshing state... [id=subnet-09f5344ab3e263e16]
aws_security_group.sg_vpc_link: Refreshing state... [id=sg-012c293cf2ef2820e]
aws_subnet.private_subnet_1: Refreshing state... [id=subnet-05c909d645b90d63b]
aws_internet_gateway.tc_internet_gateway: Refreshing state... [id=igw-08e7c913d3dcd10d1]
aws_subnet.public_subnet_1: Refreshing state... [id=subnet-0e73e5815ec527dea]
aws_security_group.eks_sg: Refreshing state... [id=sg-0db7842cc6b33976d]
aws_subnet.private_subnet_2: Refreshing state... [id=subnet-013bd148b01745f1f]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0b40979480542b0ef]
aws_route_table.public_route_table: Refreshing state... [id=rtb-058dd0687996ecadd]
aws_route_table.private_route_table: Refreshing state... [id=rtb-0cb170a24f6d07f90]
aws_route_table_association.public_association_1: Refreshing state... [id=rtbassoc-04157de5cbd2fe2c7]
aws_route_table_association.public_association_2: Refreshing state... [id=rtbassoc-00ff66b5f787450af]
aws_apigatewayv2_vpc_link.tc_vpc_link: Refreshing state... [id=xa9v0d]
aws_eks_cluster.tc_eks_cluster: Refreshing state... [id=eks_vid-proc]
aws_route_table_association.private_route_table_association_2: Refreshing state... [id=rtbassoc-0383b4626d52c240c]
aws_route_table_association.private_route_table_association_1: Refreshing state... [id=rtbassoc-0d463e1dcc41e1980]
aws_eks_access_policy_association.tc_eks_policy: Refreshing state... [id=eks_vid-proc#arn:aws:iam::660888316179:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_access_entry.access-entry: Refreshing state... [id=eks_vid-proc:arn:aws:iam::660888316179:role/voclabs]
aws_eks_node_group.tc_eks_node_group: Refreshing state... [id=eks_vid-proc:ng-vid-proc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_apigatewayv2_integration.tc_eks_api_integration_status_tracking will be created
  + resource "aws_apigatewayv2_integration" "tc_eks_api_integration_status_tracking" {
      + api_id                                    = "nke2af8wyh"
      + connection_id                             = "xa9v0d"
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:us-east-1:660888316179:loadbalancer/net/ac81a4c0e46834aa490beb0959e027c9/a02a58fbc9b2fb73"
      + payload_format_version                    = "1.0"
      + request_parameters                        = {
          + "overwrite:path" = "/$request.path.proxy"
        }
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_integration.tc_eks_api_integration_upload will be created
  + resource "aws_apigatewayv2_integration" "tc_eks_api_integration_upload" {
      + api_id                                    = "nke2af8wyh"
      + connection_id                             = "xa9v0d"
      + connection_type                           = "VPC_LINK"
      + id                                        = (known after apply)
      + integration_method                        = "ANY"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "HTTP_PROXY"
      + integration_uri                           = "arn:aws:elasticloadbalancing:us-east-1:660888316179:loadbalancer/net/a002e4068d97649f0bc5e71a5e16ffd2/fef7b167611e81b9"
      + payload_format_version                    = "1.0"
      + request_parameters                        = {
          + "overwrite:path" = "/$request.path.proxy"
        }
      + timeout_milliseconds                      = (known after apply)
    }

  # aws_apigatewayv2_route.all_status will be created
  + resource "aws_apigatewayv2_route" "all_status" {
      + api_id             = "nke2af8wyh"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /status/{proxy+}"
      + target             = (known after apply)
    }

  # aws_apigatewayv2_route.all_upload will be created
  + resource "aws_apigatewayv2_route" "all_upload" {
      + api_id             = "nke2af8wyh"
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "ANY /upload/{proxy+}"
      + target             = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @AlexisCesar, Action: `pull_request`*